GraftonJames/STM32_Shape_the_world/main.c
#include <stdint.h>
#include <stdbool.h>

#include "stm32wb15xx.h"

#define BIT(x) (1UL << (x))
#define PIN(bank, num) ((((bank) - 'A') << 8) | (num))
#define PINNO(pin) ((uint8_t) pin & 255)
#define PINBANK(pin) (pin >> 8)

enum {GPIO_MODE_INPUT, GPIO_MODE_OUTPUT, GPIO_MODE_AF, GPIO_MODE_ANALOG};
#define GPIO(bank) ((GPIO_TypeDef *) (GPIOA_BASE + 0x400U * (bank))) 

static inline void
gpio_set_mode(uint32_t pin, uint8_t mode)
{
	GPIO_TypeDef *gpio = GPIO(PINBANK(pin));
	uint8_t n = PINNO(pin);

	gpio->MODER &= ~(3U << (n * 2));
	gpio->MODER |=	(mode & 3) << (n * 2);
}

static inline void
gpio_write(uint32_t pin, bool val)
{
	GPIO_TypeDef *gpio = GPIO(PINBANK(pin));
	gpio->BSRR = (1U << PINNO(pin)) << (val ? 0 : 16);
}

static inline void
systick_init(uint32_t ticks)
{
	if ((ticks - 1) > 0xffffff) return;
	
	SysTick->LOAD = ticks - 1;
	SysTick->VAL = 0;
	SysTick->CTRL = BIT(0) | BIT(1) | BIT(2);
}

static inline void
spin(volatile uint32_t count)
{
	while (count--) (void) 0;
}
static volatile uint32_t s_ticks;
void
delay(unsigned ms)
{
	uint32_t until = s_ticks + ms;
	while (s_ticks < until) (void) 0;
}

bool
timer_expired(uint32_t *t, uint32_t prd, uint32_t now)
{
	if (now + prd < *t) *t = 0;
	if (*t == 0) *t = now + prd;
	if (*t > now) return false;
	*t = (now - *t) > prd ? now + prd : *t + prd;
	return true;
}

int
main(void)
{
	GPIO_TypeDef *gpiob = GPIO(PINBANK(PIN('B', 0)));
	uint32_t out = PIN('B',4);
	bool blink = true;
	
	while(1) {
		bool arm = (bool) (gpiob->IDR & GPIO_IDR_ID0);
		bool sensor = (bool) (gpiob->IDR & (GPIO_IDR_ID1 | GPIO_IDR_ID2));
		if (sensor && arm) {
			gpio_write(out, blink);
			blink = !blink;
			delay(100);
		} else {
			gpio_write(out, false);
		}
	}
	return 0;
}

void
SysTick_Handler(void) {
	s_ticks++;
}

void
_init(void) {
	return;
}

void SystemInit(void)
{
	systick_init(10000);

	uint16_t in1 = PIN('B', 0);
	uint16_t in2 = PIN('B', 1);
	uint16_t in3 = PIN('B', 2);
	uint16_t out_pin = PIN('B', 4);

	RCC->AHB2ENR |= BIT(PINBANK(in1));
	gpio_set_mode(in1, GPIO_MODE_INPUT);
	gpio_set_mode(in2, GPIO_MODE_INPUT);
	gpio_set_mode(in3, GPIO_MODE_INPUT);
	gpio_set_mode(out_pin, GPIO_MODE_OUTPUT);

}

void SystemCoreClockUpdate(void)
{
}
